Revit 2025 API
ReleaseType Enumeration
 The release type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ReleaseType
Public Enumeration ReleaseType
public enum class ReleaseType
type ReleaseType
Members
Member name | Value | Description
Fixed | 0 |  Fixed.
Pinned | 1 |  Pinned.
BendingMoment | 2 |  Bending Moment.
UserDefined | 3 |  User Defined.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace